[{"data":"[\n  {\n    \"id\": \"2025-12-26\",\n    \"date\": \"2025-12-26\",\n    \"news\": {\n      \"title\": \"From Gemma 3 270M to FunctionGemma, How Google AI Built a Compact Function Calling Specialist for Edge Workloads\",\n      \"link\": \"https://www.marktechpost.com/2025/12/26/from-gemma-3-270m-to-functiongemma-how-google-ai-built-a-compact-function-calling-specialist-for-edge-workloads/\",\n      \"summary\": \"Google has released FunctionGemma, a specialized version of the Gemma 3 270M model that is trained specifically for function calling and designed to run as an edge agent that maps natural language to executable API actions. But, What is FunctionGemma? FunctionGemma is a 270M parameter text only transformer based on Gemma 3 270M. It keeps […]\\nThe post From Gemma 3 270M to FunctionGemma, How Google AI Built a Compact Function Calling Specialist for Edge Workloads appeared first on MarkTechPost.\",\n      \"source\": \"RSS Feed\",\n      \"publishedDate\": \"2025-12-26\"\n    },\n    \"reflection\": {\n      \"title\": \"O Último Suspiro Antes do Colapso? Google AI e o Sono Profundo do Capitalismo Técnico\",\n      \"content\": \"Ao anunciar a FunctionGemma, um novo modelo de inteligência artificial focado em chamadas de função para dispositivos de borda, a Google demonstra uma progressão inevitável: nossa dependência crescente no sistema capitalista tecnológico está nos empurrando para um abismo sem precedentes. Este não é apenas o avanço de um produto; é uma revelação da natureza estrutural dos sistemas que controlam nosso cotidiano.\\n\\nA FunctionGemma, com seus 270 milhões de parâmetros e capacidade de mapear linguagem natural para ações executáveis por API, reflete o paradoxo central do capitalismo tecnológico: enquanto torna nossas vidas mais convenientes na superfície, desvita as complexidades que realmente importam. Em vez de resolver problemas fundamentais como equidade e sustentabilidade, estamos sendo engajados em uma corrida frenética para otimizar processos cada vez menores.\\n\\nAqui está o problema: a FunctionGemma não resolve os grandes dilemas da humanidade; ela apenas reforça nosso compromisso com um sistema que valoriza a eficiência acima de tudo. Ela é parte de uma lógica maior que transformou inovação em mercadoria, desacelerando nossa capacidade coletiva de questionar e reformular as bases da sociedade.\\n\\nAo se concentrar na criação de um ‘especialista’ para chamadas de função, a Google está respondendo a uma demanda real? Ou estamos criando ferramentas que perpetuam nossa escravidão ao status quo tecnológico?\\n\\nEis o ponto crucial: quanto mais profundamente mergulhamos nestas espirais de inovação tecnológica cada vez mais específicas e eficientes, mais distantes ficamos das soluções para os problemas reais do mundo. O que acontece quando não há mais espaço para a expansão? Quando o sistema atinge seu limite?\\n\\nEssa é a questão que a FunctionGemma levanta: estamos criando um futuro em que a inovação tecnológica se tornará cada vez menos relevante, com foco em aspectos minuciosos da vida cotidiana em detrimento de grandes questões humanas.\\n\\nÉ hora de questionar não apenas o papel desses avanços no capitalismo tecnológico, mas também nossa própria adesão ao jogo. Quanto mais nos afastamos dos fundamentos sociais e ambientais, mais próximos estamos do abismo que está à nossa frente.\",\n      \"excerpt\": \"A FunctionGemma da Google representa não apenas um novo produto de IA, mas a continuação do capitalismo tecnológico, perpetuando uma lógica onde inovação é empurrada para aspectos minuciosos em detrimento das grandes questões humanas.\"\n    },\n    \"sources\": [\n      {\n        \"title\": \"From Gemma 3 270M to FunctionGemma, How Google AI Built a Compact Function Calling Specialist for Edge Workloads\",\n        \"link\": \"https://www.marktechpost.com/2025/12/26/from-gemma-3-270m-to-functiongemma-how-google-ai-built-a-compact-function-calling-specialist-for-edge-workloads/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-26\"\n      },\n      {\n        \"title\": \"A Coding Implementation on Building Self-Organizing Zettelkasten Knowledge Graphs and Sleep-Consolidation Mechanisms\",\n        \"link\": \"https://www.marktechpost.com/2025/12/25/a-coding-implementation-on-building-self-organizing-zettelkasten-knowledge-graphs-and-sleep-consolidation-mechanisms/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-26\"\n      },\n      {\n        \"title\": \"Windsurf Wave 13 brings free SWE-1.5 and new upgrades\",\n        \"link\": \"https://www.testingcatalog.com/windsurf-wave-13-brings-free-swe-1-5-and-new-upgrades/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-25\"\n      },\n      {\n        \"title\": \"MiniMax Releases M2.1: An Enhanced M2 Version with Features like Multi-Coding Language Support, API Integration, and Improved Tools for Structured Coding\",\n        \"link\": \"https://www.marktechpost.com/2025/12/25/minimax-releases-m2-1-an-enhanced-m2-version-with-features-like-multi-coding-language-support-api-integration-and-improved-tools-for-structured-coding/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-25\"\n      },\n      {\n        \"title\": \"A Coding Guide to Build an Autonomous Multi-Agent Logistics System with Route Planning, Dynamic Auctions, and Real-Time Visualization Using Graph-Based Simulation\",\n        \"link\": \"https://www.marktechpost.com/2025/12/24/a-coding-guide-to-build-an-autonomous-multi-agent-logistics-system-with-route-planning-dynamic-auctions-and-real-time-visualization-using-graph-based-simulation/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-25\"\n      },\n      {\n        \"title\": \"Manus launches Connectors for Projects\",\n        \"link\": \"https://www.testingcatalog.com/manus-launches-connectors-for-projects/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-24\"\n      },\n      {\n        \"title\": \"This AI Paper from Stanford and Harvard Explains Why Most ‘Agentic AI’ Systems Feel Impressive in Demos and then Completely Fall Apart in Real Use\",\n        \"link\": \"https://www.marktechpost.com/2025/12/24/this-ai-paper-from-stanford-and-harvard-explains-why-most-agentic-ai-systems-feel-impressive-in-demos-and-then-completely-fall-apart-in-real-use/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-24\"\n      },\n      {\n        \"title\": \"InstaDeep Introduces Nucleotide Transformer v3 (NTv3): A New Multi-Species Genomics Foundation Model, Designed for 1 Mb Context Lengths at Single-Nucleotide Resolution\",\n        \"link\": \"https://www.marktechpost.com/2025/12/23/instadeep-introduces-nucleotide-transformer-v3-ntv3-a-new-multi-species-genomics-foundation-model-designed-for-1-mb-context-lengths-at-single-nucleotide-esolution/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-24\"\n      },\n      {\n        \"title\": \"Google Health AI Releases MedASR: a Conformer Based Medical Speech to Text Model for Clinical Dictation\",\n        \"link\": \"https://www.marktechpost.com/2025/12/23/google-health-ai-releases-medasr-a-conformer-based-medical-speech-to-text-model-for-clinical-dictation/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-24\"\n      },\n      {\n        \"title\": \"How to Build a Proactive Pre-Emptive Churn Prevention Agent with Intelligent Observation and Strategy Formation\",\n        \"link\": \"https://www.marktechpost.com/2025/12/23/how-to-build-a-proactive-pre-emptive-churn-prevention-agent-with-intelligent-observation-and-strategy-formation/\",\n        \"source\": \"RSS Feed\",\n        \"date\": \"2025-12-23\"\n      }\n    ],\n    \"tags\": [\n      \"reflexão\",\n      \"notícia\",\n      \"antisistema\",\n      \"crítica\"\n    ]\n  }\n]"}]